lerebel103/RebelEspresso-firmware/sdkconfig.defaults
#
# RebelEspresso sdkconfig.defaults
#
# Only non-default settings are tracked here. The full sdkconfig is generated
# at build time by idf.py from these defaults. Do NOT edit sdkconfig directly.
#
# Hardware: ESP32, 16MB flash, ST7796 TFT, NimBLE, WiFi, AWS IoT, HomeKit
#

# Target and flash
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table (custom, hardware-revision specific)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="components/rebel-espresso/src/hw/r2/partitions.csv"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Bootloader
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=4
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET="nvs"
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Bluetooth — NimBLE only, BLE-only mode
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_BLE_MAX_CONN=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# TFT Configuration (ST7796 display)
CONFIG_ST7796=y
CONFIG_WIDTH=240
CONFIG_HEIGHT=240
CONFIG_OFFSETX=0
CONFIG_OFFSETY=0
CONFIG_MOSI_GPIO=13
CONFIG_SCLK_GPIO=14
CONFIG_CS_GPIO=33
CONFIG_DC_GPIO=22
CONFIG_RESET_GPIO=4
CONFIG_BL_GPIO=25

# MFi I2C (HomeKit)
CONFIG_DR_400=y
CONFIG_IC2_SPEED=400000
CONFIG_SDA_GPIO=26
CONFIG_SCL_GPIO=27
CONFIG_I2C_MAX_READ_COUNT=150
CONFIG_I2C_RETRY_COUNT=200

# HAP HTTP Server
CONFIG_HAP_HTTP_STACK_SIZE=8192
CONFIG_HAP_HTTP_SERVER_PORT=80
CONFIG_HAP_HTTP_MAX_OPEN_SOCKETS=5
CONFIG_HAP_HTTP_MAX_URI_HANDLERS=16

# System
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4496
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_MAX_ACTIVE_TCP=16
CONFIG_LWIP_MAX_LISTENING_TCP=16
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_SO_REUSE=y

# mbedTLS
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# MQTT (AWS IoT)
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y
CONFIG_MQTT_AWSC_TASK_STACK_SIZE=4096
CONFIG_MQTT_NETWORK_BUFFER_SIZE=4096

# AWS OTA
CONFIG_OTA_DATA_OVER_MQTT=y
CONFIG_OTA_DATA_OVER_MQTT_PRIMARY=y
CONFIG_MAX_NUM_BLOCKS_REQUEST=10
CONFIG_MAX_NUM_OTA_DATA_BUFFERS=1

# BLE WiFi Provisioning
CONFIG_BLE_WIFI_PROV_ENABLED=y
CONFIG_BLE_WIFI_PROV_CUSTOM_SERVICE_UUID_HIGH=0xFB4136D2F24B11ED
CONFIG_BLE_WIFI_PROV_CUSTOM_SERVICE_UUID_LOW=0xB2A5B6191059C7C3

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y

# Coexistence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# SHA512 needed by HomeKit SDK
CONFIG_MBEDTLS_SHA512_C=y
